Guguitino/STM32N6-Audio-Low-Latency/STM32N6-Audio-Low-Latency-Bypass/Projects/GS/Src/audio_bm.c
/**
 ******************************************************************************
 * @file    audio_bm.c
 * @author  MCD Application Team
 * @version V2.0.0
 * @date    02-May-2025
 * @brief
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"
#include "stm32n6570_discovery.h"
#include "stm32n6570_discovery_xspi.h"
#include "stm32n6570_discovery_audio.h"
#include "app_config.h"
#include "system_clock_config.h"
#include "misc_toolbox.h"
#ifdef APP_DVFS
#include "pm_dvfs.h"
#endif
#ifdef CPU_STATS
#include "cpu_stats.h"
#endif
#include "AudioCapture_ring_buff.h"
#include "preproc_dpu.h"                           /* Preprocessing includes  */
#include "postproc_dpu.h"                          /* Postprocessing includes */
#include "ai_dpu.h"                                /* AI includes             */
#include "test.h"
#include "audio_bm.h"

/* Private define ------------------------------------------------------------*/
#define AUDIO_ACQ_LEN     (CTRL_X_CUBE_AI_ACQ_LENGTH)
#if (CTRL_X_CUBE_AI_SPECTROGRAM_COL_OVL > 0)
#define AUDIO_ACQ_OFFSET  ((CTRL_X_CUBE_AI_SPECTROGRAM_COL_OVL*2 -1)*CTRL_X_CUBE_AI_SPECTROGRAM_HOP_LENGTH+CTRL_X_CUBE_AI_SPECTROGRAM_WINDOW_LENGTH)
#else
#define AUDIO_ACQ_OFFSET  (CTRL_X_CUBE_AI_SPECTROGRAM_WINDOW_LENGTH-CTRL_X_CUBE_AI_SPECTROGRAM_HOP_LENGTH)
#endif
#define AUDIO_OUT_FIRST   (CTRL_X_CUBE_AI_SPECTROGRAM_COL_OVL*CTRL_X_CUBE_AI_SPECTROGRAM_HOP_LENGTH)

/* Private function prototypes -----------------------------------------------*/
static void IAC_Config(void);
static void MPU_Config(void);
static void Ext_Mem_Config(void);
static void Int_Mem_Config(void);
static void SleepClks_init(void);
static void Error_Handler(void);
static void Record_Init(void);
static void NPU_SettingsLog(void);

#ifdef CPU_STATS
static void printCpuStats(void);
#endif

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
static void initAudioPlayBack(AudioBM_play_back_t *ctx_ptr);
static void AudioPlayBack(AudioBM_play_back_t *ctx_ptr, int16_t *pData, \
		uint16_t nbSamples);
static float vumeter(int16_t * pAudioSmp,int nb_sample);
#endif

/* Private variables ---------------------------------------------------------*/
static bool AudioProcIsOn;

#ifdef APP_BARE_METAL
static AudioBM_acq_t  audio_acq_ctx;
static AudioBM_proc_t audio_proc_ctx;
static AudioBM_play_back_t audio_playback_ctx;

static AudioBM_proc_t audio_ll_ctx;
#endif
#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
int16_t  proc_buf[PROC_BUFFER_SIZE] __NON_CACHEABLE;
int16_t playback_buf[PLAYBACK_BUFFER_SIZE] __NON_CACHEABLE;

int16_t  ll_playback_buf[1280*4] __NON_CACHEABLE;
#endif

typedef struct
{
	uint32_t bufferSize;
	uint32_t readSampleIndex;
	uint32_t writeSampleIndex;
	uint32_t availableSamples;
}ring_buff_stats_t;

static ring_buff_stats_t ringBuffStatsBuf[2];

/**
 * @brief  Initializes the system according to the application
 *         system requirement.
 * @param  None
 * @retval None
 */
void init_bm(void)
{
	/* Power on ICACHE */
	MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

	/* Set back system and CPU clock source to HSI */
	__HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
	__HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

	HAL_Init();

	SystemClock_Config_Full();

#ifdef APP_DVFS
	pm_init_dvfs();
#endif
	/* Force fusing of the OTP when using a Nucleo/DK board only */
#if (defined(USE_STM32N6xx_NUCLEO) || defined(USE_STM32N6570_DK))
	fuse_vddio();
#endif

	MPU_Config();
	Int_Mem_Config();
	Ext_Mem_Config();
	NPU_Config();
	IAC_Config();
	SCB_EnableICache();
	SCB_EnableDCache();
	SleepClks_init(); /* configures for sleep */

	/* BSP inits */
	UART_Config();
	BSP_PB_Init(BUTTON_USER1, BUTTON_MODE_EXTI);
	BSP_PB_Init(BUTTON_TAMP, BUTTON_MODE_EXTI);
	BSP_LED_Init(LED_GREEN);
	BSP_LED_Init(LED_RED);

	/* configuration information on console */
	displaySystemSetting();

	/* by default processing is active */
	AudioProcIsOn = true;
}

#ifdef APP_BARE_METAL
/**
 * @brief  main loop for bare metal implementation.
 * @param  None
 * @retval None
 */
void exec_bm(void)
{
	bool cont = true;
	time_stats_init();
	initAudioPlayBack(&audio_playback_ctx);
	initAudioProc(&audio_proc_ctx);

	initAudioCapture(&audio_acq_ctx);
	startAudioCapture(&audio_acq_ctx);
	printHeader();

	while(cont)
	{
		__NOP(); /* to be resilient to gcc optim ... to investigate */
#ifdef  APP_LP
		HAL_SuspendTick();
		HAL_PWR_EnterSLEEPMode(0, PWR_SLEEPENTRY_WFI);
		HAL_ResumeTick();
#endif /* APP_LP */

		uint16_t	audio_acq_len = AUDIO_ACQ_LEN;

		uint32_t availableSamples = audio_acq_ctx.ring_buff.availableSamples;

		if (availableSamples >= audio_acq_len)
		{
			cont = audio_process(&audio_acq_ctx, &audio_proc_ctx, audio_acq_len);
#ifdef CPU_STATS
			printCpuStats();
#endif
		}
	}
	stopAudioCapture();

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
	stopAudioPlayBack();
#endif

	test_dump();
	my_printf("\n\r# End Processing\n\r");
}
#endif
/**
 * @brief  Initializes all Audio processing
 * @param  proc_ctx_ptr pointer to processing context
 * @retval None
 */
void initAudioProc(AudioBM_proc_t * ctx_ptr)
{
	struct npu_model_info *pxInfo;
	/* init test facilities */
	test_init();
	/* get the AI model */
	AiDPULoadModel( &ctx_ptr->aiCtx, CTRL_X_CUBE_AI_MODEL_NAME );
	pxInfo     = &ctx_ptr->aiCtx.net_exec_ctx->info;
	ctx_ptr->ai_in_ptr = (int8_t *) LL_Buffer_addr_start(pxInfo->in_bufs[0]);
	ctx_ptr->ai_out_ptr = pxInfo->out_bufs[0] ;
	/* clear input samples array ( get silence on first overlayed patch */
	memset(ctx_ptr->proc_buff,0,PATCH_LENGTH*sizeof(int16_t));
	/* Audio Preprocessing init */
	PreProc_DPUInit(&ctx_ptr->audioPreCtx);
	/* Audio Postprocessing init */
	PostProc_DPUInit(&ctx_ptr->audioPostCtx);
	/* transfer quantization parametres included in AI model to the Audio DPU   */
	ctx_ptr->audioPreCtx.output_Q_offset    = ctx_ptr->aiCtx.input_Q_offset;
	ctx_ptr->audioPreCtx.output_Q_inv_scale =
			(PREPROC_FLOAT_T) ctx_ptr->aiCtx.input_Q_inv_scale;
	ctx_ptr->audioPreCtx.quant.output_Q_inv_scale = ctx_ptr->audioPreCtx.output_Q_inv_scale;
	ctx_ptr->audioPreCtx.quant.output_Q_offset = ctx_ptr->audioPreCtx.output_Q_offset;
	ctx_ptr->cnt = 0;


	ctx_ptr->audioPlayBackCtx.ring_buff.readSampleIndex  = 0 ;
	ctx_ptr->audioPlayBackCtx.ring_buff.writeSampleIndex = 0 ;
	ctx_ptr->audioPlayBackCtx.ring_buff.nbFrames = 1;
	ctx_ptr->audioPlayBackCtx.ring_buff.nbBytesPerSample = 2;
	ctx_ptr->audioPlayBackCtx.ring_buff.nbSamples = PROC_BUFFER_SIZE;
	ctx_ptr->audioPlayBackCtx.ring_buff.pData = (uint8_t *) proc_buf;
	ctx_ptr->audioPlayBackCtx.cnt = 0 ;
}


/**
 * @brief  audio processing - pre, main, and post
 * @param  acq_ctx_ptr pointer to acquisition context
 * @param  proc_ctx_ptr pointer to processing context
 * @retval true if continue condition is met
 */
bool audio_process(AudioBM_acq_t * acq_ctx_ptr,AudioBM_proc_t * proc_ctx_ptr, uint16_t audio_acq_len)
{

#if (CTRL_X_CUBE_AI_MODE_OUTPUT_1 == CTRL_AI_CLASS_DISTRIBUTION )
	bool isNotSilence, isPlayback;
#endif

	uint8_t *proc_buf = (uint8_t *) proc_ctx_ptr->proc_buff;
	uint8_t *proc_buf_ovl = (uint8_t *) (&proc_ctx_ptr->proc_buff[audio_acq_len]);
	uint8_t *acq_buf = (uint8_t *) (&proc_ctx_ptr->proc_buff[AUDIO_ACQ_OFFSET]);
	bool cont = true;

#ifdef APP_DVFS
	pm_set_opp_min(OPP_MAX);
#endif /* APP_DVFS */

	/* prepare overlapping samples from previous patch */
	memcpy(proc_buf,proc_buf_ovl,AUDIO_ACQ_OFFSET*sizeof(int16_t));

