Guguitino/STM32N6-Audio-Low-Latency/STM32N6-Audio-Low-Latency-Bypass/Projects/GS/Src/audio_bm.c
}

#endif

/**
 * @brief  Displays System Settings
 * @param  None
 * @retval None
 */
void displaySystemSetting(void)
{
	my_printf("\n\r");
	my_printf(SEPARATION_LINE);
	my_printf("        System configuration (%s)\n\r",APP_CONF_STR);
	my_printf(SEPARATION_LINE);
	printf("\n\rLog Level: %s\n\n\r", getLogLevelStr(LOG_LEVEL));
	systemSettingLog();
	NPU_SettingsLog();
#if defined (APP_DVFS) || defined (APP_LP)
	my_printf("\r\nLow Power Options:");
#ifdef APP_LP
	my_printf("\r\n DPS");
#endif /* APP_LP */
#ifdef APP_DVFS  
	my_printf("\r\n DFVS");
#endif /* APP_DFVS */
	my_printf("\r\n");
#endif /* APP_DVFS || APP_LP */
}

void toggle_audio_proc(void)
{
	BSP_LED_Toggle(LED_RED);
	AudioProcIsOn = !AudioProcIsOn;
}

/**
 * @brief  Manages the BSP audio half transfer.
 * @param  pHdle pointer to audio ring buffer handle
 * @param  pData pointer to audio acquired samples buffer
 * @param  half_buf id ( 0 or 1 )
 * @retval None.
 */
void AudioCapture_half_buf_cb(AudioCapture_ring_buff_t *pHdle, int16_t *pData, uint8_t half_buf)
{
	int16_t *in_p = pData + half_buf * (CAPTURE_BUFFER_SIZE/ 2);
	AudioCapture_ring_buff_feed(pHdle, (uint8_t *)in_p, CAPTURE_BUFFER_SIZE/ 2);
}

#ifdef APP_BARE_METAL
/**
 * @brief  Manage the BSP audio in transfer complete event.
 * @param  Instance Audio in instance.
 * @retval None.
 */
void BSP_AUDIO_IN_TransferComplete_CallBack(uint32_t Instance)
{
	if (Instance == 1U)
	{
		AudioCapture_half_buf_cb(&audio_acq_ctx.ring_buff, audio_acq_ctx.acq_buf, 1U);
	}
}

/**
 * @brief  Manage the BSP audio in half transfer complete event.
 * @param  Instance Audio in instance.
 * @retval None.
 */
void BSP_AUDIO_IN_HalfTransfer_CallBack(uint32_t Instance)
{
	if (Instance == 1U)
	{
		AudioCapture_half_buf_cb(&audio_acq_ctx.ring_buff, audio_acq_ctx.acq_buf, 0U);
	}
}
#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
/**
 * @brief  Tx Transfer completed callbacks.
 * @param  None.
 * @retval None.
 */
void BSP_AUDIO_OUT_TransferComplete_CallBack(uint32_t Instance)
{
	assert(Instance==0);
	AudioCapture_ring_buff_consume_no_cpy(&audio_playback_ctx.ring_buff, PLAYBACK_BUFFER_SIZE/2);

	uint8_t pass_buff[PLAYBACK_BUFFER_SIZE/2];
	AudioCapture_ring_buff_consume(pass_buff, &audio_proc_ctx.audioPlayBackCtx.ring_buff, PLAYBACK_BUFFER_SIZE/2);
	AudioCapture_ring_buff_feed(&audio_playback_ctx.ring_buff, pass_buff, PLAYBACK_BUFFER_SIZE/2);
}

/**
 * @brief  Tx Transfer Half completed callbacks
 * @param  None.
 * @retval None.
 */
void BSP_AUDIO_OUT_HalfTransfer_CallBack(uint32_t Instance)
{
	assert(Instance==0);
	AudioCapture_ring_buff_consume_no_cpy(&audio_playback_ctx.ring_buff, PLAYBACK_BUFFER_SIZE/2);

	uint8_t pass_buff[PLAYBACK_BUFFER_SIZE/2];
	AudioCapture_ring_buff_consume(pass_buff, &audio_proc_ctx.audioPlayBackCtx.ring_buff, PLAYBACK_BUFFER_SIZE/2);
	AudioCapture_ring_buff_feed(&audio_playback_ctx.ring_buff, pass_buff, PLAYBACK_BUFFER_SIZE/2);
}
#endif /* (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)  */

/**
 * @brief  Manages the BSP audio in error event.
 * @param  Instance Audio in instance.
 * @retval None.
 */
void BSP_AUDIO_IN_Error_CallBack(uint32_t Instance)
{
	Error_Handler();
}

void BSP_PB_Callback(Button_TypeDef Button)
{
	if (BUTTON_USER1 == Button)
	{
		toggle_audio_proc();
	}
}
#endif

/*==============================================================================
                    private  functions definition
 ============================================================================= */

#if (CTRL_X_CUBE_AI_AUDIO_OUT==COM_TYPE_HEADSET)
/**
 * @brief  Playback initialization
 * @param  ctx_ptr play back execution context
 * @retval None
 */
static void initAudioPlayBack(AudioBM_play_back_t *ctx_ptr)
{
	BSP_AUDIO_Init_t AudioInit;

	/* Configure playback */
	AudioInit.Device        = AUDIO_OUT_DEVICE_HEADPHONE;
	AudioInit.SampleRate    = AUDIO_FREQUENCY;
	AudioInit.BitsPerSample = AUDIO_RESOLUTION_16B;
	AudioInit.ChannelsNbr   = 1;
	AudioInit.Volume        = 0; /* not used */

	if (BSP_ERROR_NONE != BSP_AUDIO_OUT_Init(0, &AudioInit))
	{
		Error_Handler();
	}
	ctx_ptr->ring_buff.readSampleIndex  = 0 ;
	ctx_ptr->ring_buff.writeSampleIndex = 0 ;
	ctx_ptr->ring_buff.nbFrames = 1;
	ctx_ptr->ring_buff.nbBytesPerSample = 2;
	ctx_ptr->ring_buff.nbSamples = PLAYBACK_BUFFER_SIZE;
	ctx_ptr->ring_buff.pData = (uint8_t *) playback_buf;
	ctx_ptr->cnt = 0 ;
}

static void AudioPlayBack(AudioBM_play_back_t *ctx_ptr, int16_t *pData,\
		uint16_t nbSamples)
{
	float lev_db = vumeter((int16_t *)pData,nbSamples);
	if (lev_db < CTRL_X_CUBE_AI_AUDIO_OUT_DB_THRESHOLD)
	{
		for (int i=0; i<nbSamples; i++){
			pData[i] = 0;
		}
	}
	AudioCapture_ring_buff_feed(& ctx_ptr->ring_buff,(uint8_t *) pData, nbSamples);

	if (ctx_ptr->cnt== 1)
	{
		/* Start the playback */
		if (BSP_ERROR_NONE != BSP_AUDIO_OUT_Play(0, ctx_ptr->ring_buff.pData, \
				PLAYBACK_BUFFER_SIZE * sizeof(int16_t)))
		{
			Error_Handler();
		}
	}
	ctx_ptr->cnt++;
}

/**
 * @brief  Displays level of audio on the console in the from of a colored bar
 * @param  IN pAudioSmp : pointer to audio samples
 * @param  IN nb_samples : number of samples
 * @retval audio level in dB
 */
static float vumeter(int16_t * pAudioSmp,int nb_samples)
{
	float sum=0 ;
	for (int i = 0 ; i < nb_samples ; i ++)
	{
		sum += pAudioSmp[i]*pAudioSmp[i];
	}
	// Float value here corresponds to log10(2**30)
	float lev_db = (float)(10*(log10(sum/(nb_samples)) - 9.03089986F));
	// Casting it back to int and removing scale factor for display
	int lev = (int) (lev_db + 10 * 9.03089986F) / 5;
	lev=(lev<0)? 0 : lev;
	lev=(lev>20)? 20 : lev;
	printf("\r\033[42m");
	for (int i = 0 ; i < lev && i < 6 ; i ++)
	{
		printf(" ");
	}
	printf("\033[43m");
	for (int i = 6 ; i < lev && i < 12 ; i ++)
	{
		printf(" ");
	}
	printf("\033[41m");
	for (int i = 12 ; i < lev ; i ++)
	{
		printf(" ");
	}
	printf("\033[0m");
	for (int i = 0 ; i < 20 - lev ; i ++)
	{
		printf(" ");
	}
	fflush(stdout);
	return lev_db;
}

#endif

static void Int_Mem_Config(void)
{
	RAMCFG_HandleTypeDef hramcfg = {0};

