Guguitino/STM32N6-Audio-Low-Latency/STM32N6-Audio-Low-Latency-Bypass/Projects/GS/Src/audio_bm.c
	__HAL_RCC_SYSCFG_CLK_ENABLE();
	__HAL_RCC_CRC_CLK_ENABLE();

#ifdef APP_LP
	/*  hramcfg.Instance =  RAMCFG_SRAM2_AXI;
  HAL_RAMCFG_DisableAXISRAM(&hramcfg);
  HAL_RAMCFG_EnableAXISRAM(&hramcfg); */
	hramcfg.Instance =  RAMCFG_SRAM6_AXI;
	HAL_RAMCFG_EnableAXISRAM(&hramcfg);

	__HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();
	__HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();

	/*  __HAL_RCC_AXISRAM2_MEM_CLK_DISABLE(); */
	__HAL_RCC_AHBSRAM1_MEM_CLK_DISABLE();
	__HAL_RCC_AHBSRAM2_MEM_CLK_DISABLE();
	__HAL_RCC_BKPSRAM_MEM_CLK_DISABLE();

#else /* APP_LP */

	RCC->MEMENR |= RCC_MEMENR_AXISRAM3EN | RCC_MEMENR_AXISRAM4EN | RCC_MEMENR_AXISRAM5EN | RCC_MEMENR_AXISRAM6EN;
	RCC->MEMENR |= RCC_MEMENR_CACHEAXIRAMEN;
	hramcfg.Instance =  RAMCFG_SRAM2_AXI;
	HAL_RAMCFG_EnableAXISRAM(&hramcfg);
	hramcfg.Instance =  RAMCFG_SRAM3_AXI;
	HAL_RAMCFG_EnableAXISRAM(&hramcfg);
	hramcfg.Instance =  RAMCFG_SRAM4_AXI;
	HAL_RAMCFG_EnableAXISRAM(&hramcfg);
	hramcfg.Instance =  RAMCFG_SRAM5_AXI;
	HAL_RAMCFG_EnableAXISRAM(&hramcfg);
	hramcfg.Instance =  RAMCFG_SRAM6_AXI;
	HAL_RAMCFG_EnableAXISRAM(&hramcfg);

	__HAL_RCC_CACHEAXIRAM_MEM_CLK_ENABLE();
	__HAL_RCC_AXISRAM2_MEM_CLK_ENABLE();
	__HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
	__HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
	__HAL_RCC_AXISRAM5_MEM_CLK_ENABLE();
	__HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();

#endif 
	/* Allow caches to be activated. Default value is 1, but the current boot sets it to 0 */
	MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk | MEMSYSCTL_MSCR_ICACTIVE_Msk;
}

/**
 * @brief  Record initialization
 * @param  None
 * @retval None
 */
static void Record_Init(void)
{
	BSP_AUDIO_Init_t AudioInit;
	uint32_t         GetData;

	/* Test of state */
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetState(1, &GetData)) Error_Handler();
	if (GetData != AUDIO_IN_STATE_RESET) Error_Handler();

	AudioInit.Device        = AUDIO_IN_DEVICE_DIGITAL_MIC;
	AudioInit.SampleRate    = AUDIO_FREQUENCY;
	AudioInit.BitsPerSample = AUDIO_RESOLUTION_16B;
	AudioInit.ChannelsNbr   = 1;
	AudioInit.Volume        = 80; /* Not used */

	if (BSP_ERROR_NONE != BSP_AUDIO_IN_Init(1, &AudioInit))
	{
		Error_Handler();
	}

	/* Test of state */
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetState(1, &GetData)) Error_Handler();
	if (GetData != AUDIO_IN_STATE_STOP) Error_Handler();

	/* Test set and get functions */
	if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetVolume(1, 10)) Error_Handler();
	/*if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetSampleRate(1, SAI_AUDIO_FREQUENCY_96K)) Error_Handler(); */
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetDevice(1, AUDIO_IN_DEVICE_ANALOG_MIC)) Error_Handler();
	if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetBitsPerSample(1, AUDIO_RESOLUTION_8B)) Error_Handler();
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetBitsPerSample(1, AUDIO_RESOLUTION_16B)) Error_Handler();
	if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetBitsPerSample(1, AUDIO_RESOLUTION_24B)) Error_Handler();
	if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetBitsPerSample(1, AUDIO_RESOLUTION_32B)) Error_Handler();
	if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_SetChannelsNbr(1, 2)) Error_Handler();
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetChannelsNbr(1, 1)) Error_Handler();

	if (BSP_ERROR_FEATURE_NOT_SUPPORTED != BSP_AUDIO_IN_GetVolume(1, &GetData)) Error_Handler();
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetSampleRate(1, &GetData)) Error_Handler();
	/*if (GetData != AUDIO_FREQUENCY_96K) Error_Handler();*/
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetDevice(1, &GetData)) Error_Handler();
	if (GetData != AUDIO_IN_DEVICE_DIGITAL_MIC) Error_Handler();
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetBitsPerSample(1, &GetData)) Error_Handler();
	if (GetData != AUDIO_RESOLUTION_16B) Error_Handler();
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_GetChannelsNbr(1, &GetData)) Error_Handler();
	if (GetData != 1U) Error_Handler();

	/* Set the initial sample rate */
	if (BSP_ERROR_NONE != BSP_AUDIO_IN_SetSampleRate(1, AudioInit.SampleRate)) Error_Handler();
}

static void NPU_SettingsLog(void)
{
	struct mcu_conf sys_conf;
	getSysConf(&sys_conf);
	my_printf("\n\rNPU Runtime configuration...\r\n");
	my_printf(" NPU clock    : %u MHz\r\n", (int)sys_conf.extra[1]/1000000);
	my_printf(" NIC clock    : %u MHz\r\n", (int)sys_conf.extra[2]/1000000);
}

/**
 * @brief  external memories configuration (Flash & RAM).
 * @param  None.
 * @retval None.
 */
static void Ext_Mem_Config(void)
{
	BSP_XSPI_NOR_Init_t Flash;
	Flash.InterfaceMode = MX66UW1G45G_OPI_MODE;
	Flash.TransferRate = MX66UW1G45G_DTR_TRANSFER;

	if(BSP_XSPI_NOR_Init(0, &Flash) != BSP_ERROR_NONE)
	{
		__BKPT(0);
	}
	BSP_XSPI_NOR_EnableMemoryMappedMode(0);
	MODIFY_REG(XSPI2->CR, XSPI_CR_NOPREF, HAL_XSPI_AUTOMATIC_PREFETCH_DISABLE); /* Hotfix for xspi: no prefetch */

#ifdef USE_EXT_SRAM
	BSP_XSPI_RAM_Init(0);
	BSP_XSPI_RAM_EnableMemoryMappedMode(0);
	MODIFY_REG(XSPI1->CR, XSPI_CR_NOPREF, HAL_XSPI_AUTOMATIC_PREFETCH_DISABLE); /* Hotfix for xspi: no prefetch */
#endif

}
static void IAC_Config(void)
{
	/* Configure IAC to trap illegal access events */
	__HAL_RCC_IAC_CLK_ENABLE();
	__HAL_RCC_IAC_FORCE_RESET();
	__HAL_RCC_IAC_RELEASE_RESET();
}

static void MPU_Config(void)
{
	MPU_Region_InitTypeDef default_config = {0};
	MPU_Attributes_InitTypeDef attr_config = {0};
	uint32_t primask_bit = __get_PRIMASK();
	__disable_irq();
	/* disable the MPU */
	HAL_MPU_Disable();
	/* create an attribute configuration for the MPU */
	attr_config.Attributes = INNER_OUTER(MPU_NOT_CACHEABLE);
	attr_config.Number = MPU_ATTRIBUTES_NUMBER0;
	HAL_MPU_ConfigMemoryAttributes(&attr_config);
	/* Create a non cacheable region */
	/*Normal memory type, code execution allowed */
	default_config.Enable = MPU_REGION_ENABLE;
	default_config.Number = MPU_REGION_NUMBER0;
	default_config.BaseAddress = __NON_CACHEABLE_SECTION_BEGIN;
	default_config.LimitAddress = __NON_CACHEABLE_SECTION_END;
	default_config.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
	default_config.AccessPermission = MPU_REGION_ALL_RW;
	default_config.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
	default_config.AttributesIndex = MPU_ATTRIBUTES_NUMBER0;
	HAL_MPU_ConfigRegion(&default_config);
	/* enable the MPU */
	HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
	/* Exit critical section to lock the system and avoid any issue around MPU mechanisme */
	__set_PRIMASK(primask_bit);
}

static void SleepClks_init(void)
{
	/* Keep all IP's enabled during WFE so they can wake up CPU. Fine tune
     this if you want to save maximum power
     this is specially needed when  LL_ATON_RT_MODE=LL_ATON_RT_ASYNC is used
	 */
	LL_BUS_EnableClockLowPower(~0);
	LL_MEM_EnableClockLowPower(~0);
	LL_AHB1_GRP1_EnableClockLowPower(~0);
	LL_AHB2_GRP1_EnableClockLowPower(~0);
	LL_AHB3_GRP1_EnableClockLowPower(~0);
	LL_AHB4_GRP1_EnableClockLowPower(~0);
	LL_AHB5_GRP1_EnableClockLowPower(~0);
	LL_APB1_GRP1_EnableClockLowPower(~0);
	LL_APB1_GRP2_EnableClockLowPower(~0);
	LL_APB2_GRP1_EnableClockLowPower(~0);
	LL_APB4_GRP1_EnableClockLowPower(~0);
	LL_APB4_GRP2_EnableClockLowPower(~0);
	LL_APB5_GRP1_EnableClockLowPower(~0);
	LL_MISC_EnableClockLowPower(~0);
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  None
 * @retval None
 */
static void Error_Handler(void)
{
	__disable_irq();
	while (1)
	{
	}
}
